In [4]:
import pandas as pd

# cria um dicionário
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Paul','Leng','Any','Bella','Carter','Peny'],
       'Venda':[200,120,320,110,400,500]}

In [5]:
# cria um dataframe
df = pd.DataFrame(data)

In [6]:
df

  Empresa    Nome  Venda
0    GOOG    Paul    200
1    GOOG    Leng    120
2    MSFT     Any    320
3    MSFT   Bella    110
4      FB  Carter    400
5      FB    Peny    500

In [10]:
# registrando e salvando um groupby na memoria
group = df.groupby('Empresa')

In [11]:
# método que calcula a soma das vendas por empresa. O pandas identifica qual o tipo de dados existente na coluna, e
# aplica o cálculo apenas para tipos compativeis.
group.sum()

         Venda
Empresa
FB         900
GOOG       320
MSFT       430

In [12]:
# retorna uma descrição mais apurada do group. 
group.describe()

        Venda
        count   mean         std    min    25%    50%    75%    max
Empresa
FB        2.0  450.0   70.710678  400.0  425.0  450.0  475.0  500.0
GOOG      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  215.0  148.492424  110.0  162.5  215.0  267.5  320.0

In [13]:
# processa a contagem dos ativos 
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [14]:
# processa o desvio padrao de vendas de determinada empresa
group.std()

              Venda
Empresa
FB        70.710678
GOOG      56.568542
MSFT     148.492424